[About Language File]
Version=10.0.0
Date=29.06.2015
Author=Lasse Rautiainen
Email=lasse@bonecode.com
Comments=If you find translation errors, let me know. Thank you.

[MainForm]
ActionDocument=&Document
ActionDocumentFormat=Format
ActionDocumentFormatSQL:h=Format SQL
ActionDocumentFormatSQL=Format SQL
ActionDocumentFormatXML:h=Format XML
ActionDocumentFormatXML=&Format XML
ActionDocumentInfo:h=Line, word, and character count
ActionDocumentInfo=&Info...
ActionDocumentViewInBrowser:h=View current document in default browser
ActionDocumentViewInBrowser:s=Alt+B
ActionDocumentViewInBrowser=&View in browser
ActionEdit=&Edit
ActionEditCopy:h=Copy the selection and put it on the clipboard
ActionEditCopy:s=Ctrl+C
ActionEditCopy=C&opy
ActionEditCut:h=Cut the selection and put it on the clipboard
ActionEditCut:s=Ctrl+X
ActionEditCut=&Cut
ActionEditDecreaseIndent:h=Decrease indent
ActionEditDecreaseIndent:s=Shift+Ctrl+U
ActionEditDecreaseIndent=&Decrease
ActionEditDelete=D&elete
ActionEditDeleteEndOfLine:h=Delete end of line
ActionEditDeleteEndOfLine:s=Shift+Ctrl+Y
ActionEditDeleteEndOfLine=&End of line
ActionEditDeleteLine:h=Delete line
ActionEditDeleteLine:s=Ctrl+Y
ActionEditDeleteLine=&Line
ActionEditDeleteWhitespace:h=Remove all whitespace from selected text
ActionEditDeleteWhitespace=W&hitespace
ActionEditDeleteWord:h=Delete word
ActionEditDeleteWord:s=Ctrl+T
ActionEditDeleteWord=&Word
ActionEditIncreaseIndent:h=Increase indent
ActionEditIncreaseIndent:s=Shift+Ctrl+I
ActionEditIncreaseIndent=Increase
ActionEditIndent=I&ndent
ActionEditInsert=Insert
ActionEditInsertDateTime:h=Insert date and time
ActionEditInsertDateTime:s=Shift+Alt+D
ActionEditInsertDateTime=&Date and time
ActionEditInsertLine:h=Insert line
ActionEditInsertLine:s=Ctrl+Enter
ActionEditInsertLine=&Line
ActionEditInsertTag:h=Insert HTML/XML tags
ActionEditInsertTag:s=Shift+Ctrl+T
ActionEditInsertTag=&HTML/XML tags...
ActionEditPaste:h=Insert clipboard contents
ActionEditPaste:s=Ctrl+V
ActionEditPaste=&Paste
ActionEditRedo:h=Redo the previously undone action
ActionEditRedo:s=Shift+Ctrl+Z
ActionEditRedo=&Redo
ActionEditSelectAll:h=Select all
ActionEditSelectAll:s=Ctrl+A
ActionEditSelectAll=&Select all
ActionEditSort=Sor&t
ActionEditSortAsc:h=Sort ascending
ActionEditSortAsc:s=Shift+Ctrl+A
ActionEditSortAsc=&Ascending
ActionEditSortDesc:h=Sort descending
ActionEditSortDesc:s=Shift+Ctrl+D
ActionEditSortDesc=&Descending
ActionEditToggleCase:h=Toggle case
ActionEditToggleCase:s=Shift+Ctrl+C
ActionEditToggleCase=To&ggle case
ActionEditToggleCaseUpper=Upper
ActionEditToggleCaseUpper:h=Toggle upper case
ActionEditToggleCaseLower=Lower
ActionEditToggleCaseLower:h=Toggle lower case
ActionEditToggleCaseAlternating=Alternating
ActionEditToggleCaseAlternating:h=Toggle alternating case
ActionEditToggleCaseSentence=Sentence
ActionEditToggleCaseSentence:h=Toggle sentence case
ActionEditToggleCaseTitle=Title
ActionEditToggleCaseTitle:h=Toggle title case
ActionEditUndo:h=Undo the last action
ActionEditUndo:s=Ctrl+Z
ActionEditUndo=&Undo
ActionFile=&File
ActionFileClose:h=Close the active document
ActionFileClose:s=Ctrl+F4
ActionFileClose=&Close
ActionFileCloseAll:h=Close all open files
ActionFileCloseAll=C&lose all
ActionFileCloseAllOther:h=Close all other pages
ActionFileCloseAllOther:s=Shift+Ctrl+F4
ActionFileCloseAllOther=Clos&e all other
ActionFileExit:h=Quit the application
ActionFileExit:s=Alt+F4
ActionFileExit=E&xit
ActionFileNew:h=Create a new document
ActionFileNew:s=Ctrl+N
ActionFileNew=&New
ActionFileOpen:h=Open an existing document
ActionFileOpen:s=Ctrl+O
ActionFileOpen=&Open...
ActionFilePrint:h=Print the active document
ActionFilePrint:s=Ctrl+P
ActionFilePrint=&Print...
ActionFilePrintPreview:h=Preview the active document
ActionFilePrintPreview=Pr&int preview...
ActionFileProperties:h=See the file properties
ActionFileProperties=Pr&operties...
ActionFileReopen=&Reopen
ActionFileReopenClear=&Clear
ActionFileSave:h=Save the active document
ActionFileSave:s=Ctrl+S
ActionFileSave=&Save
ActionFileSaveAll:h=Save all documents
ActionFileSaveAll:s=Shift+Ctrl+S
ActionFileSaveAll=Sa&ve all
ActionFileSaveAs:h=Save the active document with a new name
ActionFileSaveAs:s=Ctrl+Alt+S
ActionFileSaveAs=S&ave as...
ActionFileSelectFromDirectory:h=Select the file from the active directory
ActionFileSelectFromDirectory=Select from directory
ActionHelp=&Help
ActionHelpAboutEditBone:h=Display information about EditBone
ActionHelpAboutEditBone=&About EditBone
ActionHelpCheckForUpdates:h=Check for updates
ActionHelpCheckForUpdates=&Check for updates
ActionHelpVisitHomepage:h=Visit EditBone homepage - http://www.bonecode.com/
ActionHelpVisitHomepage=&Visit homepage
ActionMacroOpen:h=Open an existing macro
ActionMacroOpen=&Open...
ActionMacroPlayback:h=Playback the macro
ActionMacroPlayback:s=Shift+Ctrl+P
ActionMacroPlayback=&Playback
ActionMacroRecordPause:h=Record or pause a macro
ActionMacroRecordPause:s=Shift+Ctrl+R
ActionMacroRecordPause=&Record
ActionMacroSaveAs:h=Save the macro with a new name
ActionMacroSaveAs=S&ave as...
ActionMacroStop:h=Stop the macro recording
ActionMacroStop:s=Shift+Ctrl+S
ActionMacroStop=&Stop
ActionSearch=&Search
ActionSearchClearBookmarks:h=Clear all bookmarks
ActionSearchClearBookmarks=Clear &bookmarks
ActionSearchFindInFiles:h=Search for a string in multiple files
ActionSearchFindInFiles:s=Shift+Ctrl+F
ActionSearchFindInFiles=&Find in files...
ActionSearchFindNext:h=Find the next matching text
ActionSearchFindNext:s=F3
ActionSearchFindNext=Find &next
ActionSearchFindPrevious:h=Find the previous matching text
ActionSearchFindPrevious:s=Shift+F3
ActionSearchFindPrevious=Find &previous
ActionSearchGoToBookmarks:h=Go to bookmarks
ActionSearchGoToBookmarks=Go to bookmarks
ActionSearchGoToLine:h=Go to line
ActionSearchGoToLine:s=Ctrl+G
ActionSearchGoToLine=Go to line
ActionSearchReplace:h=Replace the specified text with different text
ActionSearchReplace:s=Ctrl+R
ActionSearchReplace=&Replace...
ActionSearchSearch:h=Search the specified text
ActionSearchSearch:s=Ctrl+F
ActionSearchSearch=&Search...
ActionSearchToggleBookmark:h=Set or clear bookmark at current line. Bookmarks can be also set by using Ctrl+Shift+1..9. Go to bookmark by using Ctrl+1..9.
ActionSearchToggleBookmark:s=Ctrl+F2
ActionSearchToggleBookmark=&Toggle bookmark
ActionSearchToggleBookmarks:h=Toggle bookmarks
ActionSearchToggleBookmarks=T&oggle bookmarks
ActionToolbarMenuLanguage=&Language
ActionToolbarMenuSkin=S&kin...
ActionToolbarMenuView=&View
ActionTools=&Tools
ActionToolsCharacterMap:h=Insert unicode characters to active document by double-clicking
ActionToolsCharacterMap=&Unicode character map...
ActionToolsCompareFiles:h=Compare files
ActionToolsCompareFiles=&Compare files...
ActionToolsConvert:h=Convert between numerical units
ActionToolsConvert=C&onvert...
ActionToolsLanguageEditor:h=Language editor
ActionToolsLanguageEditor=&Language editor...
ActionToolsOptions:h=Set options
ActionToolsOptions=&Options...
ActionToolsSelectForCompare:h=Select document for compare
ActionToolsSelectForCompare=Select for compare...
ActionView=&View
ActionViewCloseDirectory:h=Close the active directory
ActionViewCloseDirectory:s=Shift+Ctrl+D
ActionViewCloseDirectory=&Close directory
ActionViewDirectory:h=Show or hide the directory
ActionViewDirectory=&Directory
ActionViewEditDirectory:h=Edit the active directory
ActionViewEditDirectory:s=Shift+Ctrl+E
ActionViewEditDirectory=&Edit directory...
ActionViewEncodingSelection:h=Show or hide the encoding selection
ActionViewEncodingSelection=Encodin&g
ActionViewFiles:h=Search files from the selected directory and its subdirectories
ActionViewFiles:s=Ctrl+F12
ActionViewFiles=&Files...
ActionViewColorSelection=Color
ActionViewColorSelection:h=Show or hide the color selection
ActionViewHighlighterSelection:h=Show or hide the highlighter selection
ActionViewHighlighterSelection=&Highlighter
ActionViewLineNumbers:h=Toggle line numbers
ActionViewLineNumbers=Line num&bers
ActionViewMainMenu=Main menu
ActionViewMainMenu:h=Show or hide the main menu
ActionViewMenuBar=Menu bar
ActionViewMenuBar:h=Show or hide the menu bar
ActionViewMiniMap:h=Show or hide the minimap
ActionViewMiniMap=Minimap
ActionViewNextPage:h=Go to next page
ActionViewNextPage:s=Ctrl+Tab
ActionViewNextPage=&Next page
ActionViewOpenDirectory:h=Open a new directory
ActionViewOpenDirectory:s=Ctrl+D
ActionViewOpenDirectory=&Open directory...
ActionViewOutput:h=Show or hide the output
ActionViewOutput=O&utput
ActionViewPreviousPage:h=Go to previous page
ActionViewPreviousPage:s=Shift+Ctrl+Tab
ActionViewPreviousPage=&Previous page
ActionViewSelectionMode:h=Toggle selection mode. Also pressing Alt on editor will toggle selection mode.
ActionViewSelectionMode=Selection &mode
ActionViewSpecialChars:h=Toggle special characters
ActionViewSpecialChars=Spec&ial chars
ActionViewSplit:h=Split the document
ActionViewSplit=&Split
ActionViewStatusBar:h=Show or hide the status bar
ActionViewStatusBar=&Status bar
ActionViewToolbar:h=Show or hide the toolbar
ActionViewToolbar=&Toolbar
ActionViewWordWrap:h=Toggle word wrap
ActionViewWordWrap=&Word wrap
ActionViewXMLTree:h=Show or hide the XML tree
ActionViewXMLTree=&XML tree

[AskYesOrNo]
CancelSearch=Cancel search, are you sure?
CloseDirectory=Close directory %s, are you sure?
DeleteDirectory=Delete directory %s, are you sure?
DeleteFile=Delete file %s, are you sure?
DeleteLine=Delete line, are you sure?
DocumentTimeChanged=Document %s's time/date changed. Reload?
NewVersion=A new version %s of %s is available.%sWould you like to download it from the Internet?
RecordMacro=Record a new macro, are you sure?
ReplaceOccurence=Replace this occurence of '%s'?
SaveChanges=Save changes?
SearchMatchNotFound=Search match not found.%sRestart search from the beginning of the file?
SearchStringNotFound=Search string '%s' not found

[Message]
CannotFindString=Cannot find the string '%s'
DocumentStatistics=Line count: %d%sWord count: %d%sCharacter count: %d
LatestVersion=You are using the latest version.

[ErrorMessage]
EnterPath=Enter path.
EnterTabName=Enter tab name.
FileNotFound=File '%s' not found.
PathNotExist=Path does not exist.
RootDirectoryNotExist=Root directory does not exist.

[WarningMessage]
FileAccessError=File %s access error.

[Constant]
AllFiles=All files
Arrow=Arrow
AutoSave=Auto save
Block=Block
Bookmark=Bookmark
Bottom=Bottom
Circle=Circle
Color=Color
CompareFiles=Compare files
CountingFiles=Counting files...
DirectoryItems=Directory items
Document=Document
Dot=Dot
DownloadCancelling=Canceling...
DownloadDone=Done.
EditDirectory=Edit Directory
Encoding=Encoding
Enter=Enter
FileMaskItems=File mask items
FilesFound=%d file(s) have been found in %s
FooterLeft=Footer - left
FooterRight=Footer - right
GoToLine=Go to line
HalfBlock=Half block
HeaderLeft=Header - left
HeaderRight=Header - right
Hide=Hide
Highlighter=Highlighter
HorizontalLine=Horizontal line
Insert=Insert
InsertTags=Insert HTML/XML Tags
InvalidName=Invalid name
LanguageEditor=Language Editor - [%s]
Line=Line
MatchFound=%d match%s found
MatchFoundPluralExtension=es
Minute=min
Modified=Modified
OccurencesFound=%d occurence(s) have been found in %s
Open=Open
OpenDirectory=Open directory
Overwrite=Overwrite
Pilcrow=Pilcrow
Position=Position: %d
PreviewDocumentPage=Page: $PAGENUM$ of $PAGECOUNT$
PreviewPage= Page: %d of %d
PreviewPrintDocument=Print (%s)|Print the document on %s
PrintedBy=Printed by %s
Rename=Do you want to rename %s to %s?
RenameFailed=%s rename failed
SaveAs=Save As
SearchFor=Search for '%s'
Second=s
SelectRootDirectory=Select root directory
Solid=Solid
Square=Square
TextToFindItems=Text to find items
ThinHorizontalLine=Thin horizontal line
ThinVerticalLine=Thin vertical line
Top=Top
TopLine=Top Line: %d
VersionInfoNotFound=Version info not found.
VerticalLine=Vertical line

[DialogConstant]
SMsgDlgAbort=&Abort
SMsgDlgAll=&All
SMsgDlgCancel=Cancel
SMsgDlgClose=&Close
SMsgDlgConfirm=Confirm
SMsgDlgError=Error
SMsgDlgHelp=&Help
SMsgDlgHelpHelp=Help
SMsgDlgHelpNone=No help available
SMsgDlgIgnore=&Ignore
SMsgDlgInformation=Information
SMsgDlgNo=&No
SMsgDlgNoToAll=N&o to All
SMsgDlgOK=OK
SMsgDlgRetry=&Retry
SMsgDlgWarning=Warning
SMsgDlgYes=&Yes
SMsgDlgYesToAll=Yes to &All

[ColorConstant]
clBlack=Black
clMaroon=Maroon
clGreen=Green
clOlive=Olive
clNavy=Navy
clPurple=Purple
clTeal=Teal
clGray=Gray
clSilver=Silver
clRed=Red
clLime=Lime
clYellow=Yellow
clBlue=Blue
clFuchsia=Fuchsia
clAqua=Aqua
clWhite=White
clMoneyGreen=Money green
clSkyBlue=Sky blue
clCream=Cream
clMedGray=Medium gray
clActiveBorder=Active border
clActiveCaption=Active caption
clAppWorkSpace=Application workspace
clBackground=Background
clBtnFace=Button face
clBtnHighlight=Button highlight
clBtnShadow=Button shadow
clBtnText=Button text
clCaptionText=Caption text
clDefault=Default
clGradientActiveCaption=Gradient active caption
clGradientInactiveCaption=Gradient inactive caption
clGrayText=Gray text
clHighlight=Highlight background
clHighlightText=Highlight text
clHotLight=Hot light
clInactiveBorder=Inactive border
clInactiveCaption=Inactive caption
clInactiveCaptionText=Inactive caption text
clInfoBk=Info background
clInfoText=Info text
clMenu=Menu background
clMenuBar=Menu bar
clMenuHighlight=Menu highlight
clMenuText=Menu text
clNone=None
clScrollBar=Scroll bar
cl3DDkShadow=3D dark shadow
cl3DLight=3D light
clWindow=Window background
clWindowFrame=Window frame
clWindowText=Window text

[FileTypes]
ActionScript=ActionScript files (*.as)
Assembler 68HC11=68HC11 Assembler files (*.hc11;*.asc)
AutoIt v3=AutoIt files (*.au3)
AWK=AWK scripts (*.awk)
C#=C# files (*.cs)
C++=C++ files (*.cpp;*.hpp)
C=C files (*.c;*.h)
CSS=Cascading Stylesheet files (*.css)
D=D files (*.d;*.di)
Delphi Form Module=Delphi Form Module files (*.dfm)
Free Pascal=Free Pascal files (*.pp)
HTML with Scripts=HTML files (*.html;*.htm)
INI=INI files (*.ini;*.lng)
Inno Setup=Inno Setup files (*.iss)
Java=Java files (*.java)
JavaScript=JavaScript files (*.js)
JSON=JSON files (*.json)
MS-DOS Batch=MS-DOS Batch files (*.bat;*.cmd)
Object Pascal=Pascal files (*.pas;*.dfm;*.dpr;*.dproj)
Perl=Perl files (*.pl;*.pm;*.cgi)
PHP=PHP files (*.php;*.class;*.inc)
Python=Python files (*.py)
Ruby=Ruby files (*.rb;*.rbw)
SQL - Standard=SQL files (*.sql)
Text=Text files (*.txt)
Visual Basic=Visual Basic files (*.vb;*.bas)
XML=XML files (*.xml;*.xsd;*.xsl;*.xslt;*.dtd)
Macro=Macro files (*.mcr)|*.mcr
Language=Language files (*.lng)|*.lng

[ConfirmReplaceDialog]
ButtonCancel=Cancel
ButtonNo=&No
ButtonYes=&Yes
ButtonYesToAll=Yes to &all
Caption=Confirm replace

[DownloadURLDialog]
ButtonCancel=Cancel
Caption=Download

[FindInFilesDialog]
ButtonCancel=Cancel
ButtonFind=&Find
Caption=Find in files
StickyLabelCaseSensitive=Case sensitive
StickyLabelIncludeSubdirectories=Include subdirectories
ComboBoxDirectory=Directory
ComboBoxFileMask=File mask
ComboBoxTextToFind=Text to find
GroupBoxOptions=Options
GroupBoxSearchDirectoryOptions=Search directory options

[InputQueryDialog]
ButtonOK=OK
ButtonCancel=Cancel

[SearchOptionsDialog]
ButtonCancel=Cancel
ButtonOK=OK
StickyLabelBeepIfSearchStringNotFound=Beep if search string not found
StickyLabelCaseSensitive=Case sensitive
StickyLabelEntireScope=Entire scope
StickyLabelHighlightResult=Highlight results
StickyLabelRegularExpression=Regular expression
StickyLabelSearchOnTyping=Search on typing
StickyLabelSelectedOnly=Selected only
StickyLabelShowSearchStringNotFound=Show search string not found
StickyLabelWholeWordsOnly=Whole words only
StickyLabelWildCard=Wildcard

[OptionsToolBarItemsDialog]
ButtonAdd=Add
ButtonCancel=Cancel
Caption=Select items
VirtualDrawTreeAddItems:0=Menu item

[ReplaceDialog]
ButtonCancel=Cancel
ButtonFind=&Find
ButtonReplaceAll=&Replace all
Caption=Replace
ComboBoxSearchFor=Search for
GroupBoxOptions=Options
GroupBoxReplaceIn=Replace in
RadioButtonAllOpenFiles=All open files
RadioButtonDeleteLine=Delete line
RadioButtonReplaceWith=Replace with
RadioButtonWholeFile=Whole file
StickyLabelCaseSensitive=Case sensitive
StickyLabelPromptOnReplace=Prompt on replace
StickyLabelRegularExpression=Regular expression
StickyLabelSelectedOnly=Selected only
StickyLabelWholeWordsOnly=Whole words only
StickyLabelWildCard=Wildcard

[ConvertForm]
Caption=Convert between numerical units
ComboBoxFrom=From
ComboBoxTo=To       
ComboBoxType=Type
EditResult=Result
EditValue=Value

[PrintPreviewDialog]
ActionColors:h=Toggle colors
ActionColors=Colors
ActionExit:h=Exit the print preview
ActionExit=Exit
ActionFirst:h=First|Go to first page
ActionFirst=First
ActionHighlight:h=Toggle highlight
ActionHighlight=Highlight
ActionLast:h=Last|Go to last page
ActionLast=Last
ActionLineNumbers:h=Toggle line numbers
ActionLineNumbers=Line Numbers
ActionNext:h=Next|Go to next page
ActionNext=Next
ActionPrevious:h=Previous|Go to previous page
ActionPrevious=Previous
ActionPrint:h=Print|Print the document
ActionPrint=Print
ActionWordWrap:h=Toggle word wrap
ActionWordWrap=Word wrap
ActionZoom:h=Zoom|Zoom in/out
ActionZoom=Zoom
ActionZoomIn:h=Zoom in
ActionZoomIn=Zoom in
ActionZoomOut:h=Zoom out
ActionZoomOut=Zoom out
Caption=Print Preview

[SearchForFilesForm]
Caption=Search for files
PanelSearchingFiles=Searching files...

[CompareFrame]
CopySelectionLeftAction:h=Copy the selection to left
CopySelectionRightAction:h=Copy the selection to right
FindNextDifferenceAction:h=Find the next difference
LeftDocumentButtonClickAction:h=Open a document
LeftLabel=Left row
OpenDocumentsLeftAction:h=Open a document
OpenDocumentsRightAction:h=Open a document
RefreshAction:h=Refresh documents
RightDocumentButtonClickAction:h=Open a document
RightLabel=Right row
SaveLeftGridAction:h=Save the document
SaveRightGridAction:h=Save the document

[OptionsCompareFrame]
StickyLabelIgnoreCase=Ignore case
StickyLabelIgnoreBlanks=Ignore blanks

[OptionsEditorCaretFrame]
StickyLabelNonblinkingCaretEnabled=Enabled
StickyLabelRightMouseClickMovesCaret=Right mouse click moves caret
StickyLabelVisible=Visible
ColorBoxNonblinkingCaretBackground=Background color
ColorBoxNonblinkingCaretForeground=Foreground color
ComboBoxStylesInsertCaret=Insert
ComboBoxStylesOverwriteCaret=Overwrite
GroupBoxNonBlinkingCaret=Non-blinking caret
GroupBoxStyles=Styles

[OptionsEditorCodeFoldingFrame]
StickyLabelFoldMultilineComments=Fold multiline comments
StickyLabelHighlightIndenGuides=Highlight indent guides
StickyLabelHighlightMatchingPair=Highlight matching pair
StickyLabelShowCollapsedCodeHint=Show collapsed code hint
StickyLabelShowCollapsedLine=Show collapsed line
StickyLabelShowIndentGuides=Show indent guides
StickyLabelUncollapseByHintClick=Uncollapse by hint click
StickyLabelVisible=Visible
ComboBoxMarkStyle=Mark style

[OptionsEditorColorFrame]
StickyLabelElementsAttributesBold=Bold
StickyLabelElementsAttributesItalic=Italic
StickyLabelElementsAttributesUnderline=Underline
StickyLabelSkinActiveLineBackground=Active line background
StickyLabelSkinBackground=Background
StickyLabelSkinBookmarkPanelBackground=Bookmark panel background
StickyLabelSkinCodeFoldingBackground=Code folding background
StickyLabelSkinCodeFoldingHintBackground=Code folding hint background
StickyLabelSkinCompletionProposalBackground=Completion proposal background
StickyLabelSkinCompletionProposalSelectionBackground=Completion proposal selection background
StickyLabelSkinForeground=Foreground
StickyLabelSkinLeftMarginBackground=Left margin background
StickyLabelSkinSelectionBackground=Selection background
StickyLabelSkinSelectionForeground=Selection foreground
ColorComboBoxEditorColor=Color
ColorComboBoxElementsBackground=Background
ColorComboBoxElementsForeground=Foreground
ComboBoxColor=Color
ComboBoxEditorElement=Element
ComboBoxElementsName=Name
ComboBoxHighlighter=Highlighter
DateEditDate=Date
EditEmail=Email
EditName=Name
EditVersion=Version
GroupBoxAttributes=Attributes
LabelSkinDescription=Use skin color for selected elements
TabSheetAuthor=Author
TabSheetEditor=Editor
TabSheetElements=Elements
TabSheetGeneral=General
TabSheetUseSkinColor=Use skin color

[OptionsEditorCompletionProposalFrame]
StickyLabelCaseSensitive=Case sensitive
StickyLabelEnabled=Enabled
ComboBoxShortcut=Shortcut

[OptionsEditorFontFrame]
ComboBoxColor=Color
ComboBoxElement=Element
EditFontSize=Font size
FontComboBoxFont=Font

[OptionsEditorLeftMarginFrame]
StickyLabelAutoSize=Auto size
StickyLabelShowAfterLastLine=Show after last line
StickyLabelShowBookmarkPanel=Show bookmark panel
StickyLabelShowBookmarks=Show bookmarks
StickyLabelShowInTens=Show in tens
StickyLabelShowLeadingZeros=Show leading zeros
StickyLabelShowLineState=Show line state
StickyLabelVisible=Visible
EditBookmarkPanelWidth=Bookmark panel width
EditWidth=Width
GroupBoxLineNumbers=Line numbers

[OptionsEditorMatchingPairFrame]
StickyLabelEnabled=Enabled
StickyLabelHighlightAfterToken=Highlight after token
StickyLabelHighlightUnmatched=Highlight unmatched

[OptionsEditorMinimapFrame]
StickyLabelVisible=Visible
StickyLabelShowIndentGuides=Show indent guides
EditWidth=Width

[OptionsEditorOptionsFrame]
StickyLabelAutoIndent=Auto indent
StickyLabelAutoSave=Auto save
StickyLabelDragDropEditing=Drag drop editing
StickyLabelDropFiles=Drop files
StickyLabelGroupUndo=Group undo
StickyLabelTrimTrailingSpaces=Trim trailing spaces
StickyLabelUndoAfterSave=Undo after save
EditLineSpacing=Line spacing

[OptionsEditorRightMarginFrame]
StickyLabelVisible=Visible
StickyLabelMouseMove=Mouse move
StickyLabelShowMovingHint=Show moving hint
EditPosition=Position

[OptionsEditorScrollFrame]
StickyLabelAutosizeMaxWidth=Autosize max width
StickyLabelHalfPage=Half page
StickyLabelHintFollows=Hint follows
StickyLabelPastEndOfFile=Past end of file
StickyLabelPastEndOfLineMarker=Past end of line marker
StickyLabelShowHint=Show hint

[OptionsEditorSearchFrame]
StickyLabelDocumentSpecificSearch=Document-specific search
StickyLabelHighlightResults=Highlight results
StickyLabelShowSearchMap=Show search map

[OptionsEditorSelectionFrame]
StickyLabelVisible=Visible
StickyLabelALTSetsColumnMode=ALT sets column mode
StickyLabelHighlightSimilarTerms=Highlight similar terms
StickyLabelToEndOfLine=To end of line
StickyLabelTripleClickRowSelect=Triple-click row select

[OptionsEditorSpecialCharsFrame]
StickyLabelUseTextColor=Use text color
ColorComboBoxColor=Color
ComboBoxStyle=Style
GroupBoxEndOfLine=End of line
StickyLabelEndOfLineVisible=Visible
GroupBoxEndOfLine=Color
ComboBoxEndOfLineStyle=Style
GroupBoxSelection=Selection
StickyLabelSelectionVisible=Visible
ColorComboBoxSelectionColor=Color

[OptionsEditorTabulatorFrame]
StickyLabelSelectedBlockIndent=Selected block indent
StickyLabelTabsToSpaces=Tabs to spaces
EditWidth=Width

[OptionsMainMenuFrame]
StickyLabelUseSystemFont=Use system font
FontComboBoxFont=Font
EditFontSize=Font size

[OptionsOutputFrame]
StickyLabelShowTreeLines=Show tree lines
StickyLabelShowCheckBox=Show check box
EditIndent=Indent

[OptionsPrintFrame]
ComboBoxDocumentName=Document name
ComboBoxPageNumber=Page number
ComboBoxPrintedBy=Printed by
ComboBoxDateTime=Date time
StickyLabelShowHeaderLine=Show header line
StickyLabelShowFooterLine=Show footer line
StickyLabelShowLineNumbers=Show line numbers
StickyLabelWordWrap=Word wrap

[OptionsSQLAlignmentsFrame]
ComboBoxKeywordAlign=Keyword align
StickyLabelKeywordAlignmentLeftJustify=Keyword alignment strict left

[OptionsSQLCapitalizationFrame]
ComboBoxKeywords=Keywords
ComboBoxIdentifier=Identifier
ComboBoxQuotedIdentifier=Quoted identifier
ComboBoxTableName=Table name
ComboBoxColumnName=Column name
ComboBoxAliasName=Alias name
ComboBoxVariableName=Variable name
ComboBoxFunctionName=Function name
ComboBoxDataType=Data type

[OptionsSQLFormatterFrame]
ComboBoxDatabase=Database

[OptionsSQLIndentationFrame]
EditIndentLength=Indent length
StickyLabelUseTab=Use tab
EditTabSize=Tab size
EditFunctionBodyIndent=Function body indent
StickyLabelBlockOnNewLine=Block on new line
EditBlockLeftIndentSize=Block left indent size
EditBlockRightIndentSize=Block right indent size
EditBlockIndentSize=Block indent size
EditSingleStatementIndent=IF/ELSE single statement indent size

[OptionsSQLInsertFrame]
ComboBoxColumnListStyle=Column list style
ComboBoxValueListStyle=Value list style
EditInsertColumnsPerLine=Insert columns per line
StickyLabelParenthesisInSeparateLines=Parenthesis in separate lines

[OptionsSQLSelectFrame]
TabSheetColumnList=Column list
TabSheetSubquery=Subquery
TabSheetIntoClause=INTO clause
TabSheetFromJoinClause=FROM/JOIN clause
TabSheetAndOrKeyword=AND/OR keyword
TabSheetGroupByClause=GROUP BY clause
TabSheetHavingClause=HAVING clause
TabSheetOrderByClause=ORDER BY clause
ComboBoxColumnListStyle=Style
ComboBoxColumnListLineBreak=Line break
StickyLabelAlignAlias=Align alias
StickyLabelColumnInNewLine=Columns in new line
StickyLabelTreatDistinctAsVirtualColumn=Treat DISTINCT as virtual column
StickyLabelNewLineAfterIn=New line after IN
StickyLabelNewLineAfterExists=New line after EXISTS
StickyLabelNewlineAfterComparisonOperator=New line after comparison operator
StickyLabelNewlineBeforeComparisonOperator=New line before comparison operator
StickyLabelIntoClauseInNewLine=INTO clause in new line
ComboBoxFromClauseStyle=Style
StickyLabelFromClauseInNewLine=FROM clause in new line
StickyLabelJoinClauseInNewLine=JOIN clause in new line
StickyLabelAlignJoinWithFromKeyword=Align JOIN with FROM keyword
StickyLabelAlignAndOrWithOnInJoinClause=Align AND/OR with ON in JOIN clause
StickyLabelAlignAliasInFromClause=Align alias in FROM clause
ComboBoxAndOrLineBreak=Line break
StickyLabelAndOrUnderWhere=AND/OR under WHERE
StickyLabelWhereClauseInNewline=WHERE clause in new line
StickyLabelWhereClauseAlignExpr=WHERE clause align expr
ComboBoxGroupByClauseStyle=Style
StickyLabelGroupByClauseInNewLine=GROUP BY clause in new line
StickyLabelHavingClauseInNewLine=HAVING clause in new line
ComboBoxOrderByClauseStyle=Style
StickyLabelOrderByClauseInNewLine=ORDER BY clause in new line

[OptionsSQLUpdateFrame]
ComboBoxColumnListStyle=Column list style

[OptionsSQLWhitespaceFrame]
StickyLabelSpaceAroundOperator=Space around operator of arithmetric expression
StickyLabelSpaceInsideCreate=Space inside parenthesis in CREATE FUNCTION/PROCEDURE
StickyLabelSpaceInsideExpression=Space inside parenthesis in expression
StickyLabelSpaceInsideSubquery=Space inside parenthesis in subquery
StickyLabelSpaceInsideFunction=Space inside parenthesis in function call
StickyLabelSpaceInsideTypename=Space inside parenthesis of typename in CREATE TABLE

[OptionsStatusBarFrame]
StickyLabelUseSystemFont=Use system font
FontComboBoxFont=Font
EditFontSize=Font size

[OptionsToolBarFrame]
VirtualDrawTree:h=Use drag and drop to move menu items. Right click popup menu to insert and delete items.
VirtualDrawTree:0=Menu item
ActionAddItem=Add item
ActionAddItem:h=Add item
ActionDelete=Delete
ActionDelete:h=Delete
ActionAddDivider=Add divider
ActionAddDivider:h=Add divider
ActionReset=Reset
ActionReset:h=Reset menu items
ActionMoveUp=Move up     
ActionMoveUp:h=Move selected item up
ActionMoveDown=Move down     
ActionMoveDown:h=Move selected item down

[AboutDialog]
Caption=About EditBone
LabelVersion=Version %s (%d-bit)
LabelCopyright=Copyright %s. All rights reserved.
LabelMemoryAvailable=Memory available to Windows: %s
LabelDevelopmentEnvironment=Development Environment
LabelThirdPartyComponents=3rd Party Components
LabelLanguageFileContributors=Language File Contributors
LabelIcons=Icons
ButtonDonations=Donations
ButtonOK=OK

[DirectoryTabDialog]
EditTabName=Tab name
EditRootDirectory=Root directory
GroupBoxOptions=Options
ComboBoxDrives=Drives
ComboBoxFileMask=File mask
StickyLabelExcludeOtherBranches=Exclude other directory branches
ButtonCancel=Cancel
ButtonOK=&OK

[LanguageEditorForm]
ActionFileNew=New
ActionFileNew:h=Create a new language file
ActionFileOpen=Open
ActionFileOpen:h=Open an existing language file
ActionFileSave=Save
ActionFileSave:h=Save the language file
ActionExit=Exit
ActionExit:h=Close the language editor
VirtualDrawTree:0=Object
VirtualDrawTree:1=Caption
VirtualDrawTree:2=Hint
VirtualDrawTree:3=Shortcut

[OptionsForm]
ActionCompare=Compare files
ActionDirectory=Directory
ActionDirectoryTabs=Tabs
ActionEditor=Editor
ActionEditorCaret=Caret
ActionEditorCodeFolding=Code folding
ActionEditorColors=Colors
ActionEditorCompletionProposal=Completion proposal
ActionEditorDefaults=Defaults
ActionEditorFonts=Font
ActionEditorLeftMargin=Left margin
ActionEditorMatchingPair=Matching pair
ActionEditorMinimap=Minimap
ActionEditorRightMargin=Right margin
ActionEditorScroll=Scroll
ActionEditorSearch=Search
ActionEditorSelection=Selection
ActionEditorSpecialChars=Special chars
ActionEditorTabs=Tabs
ActionEditorTabulator=Tabulator
ActionFileTypes=File types
ActionMainMenu=Main menu
ActionOutput=Output
ActionOutputTabs=Tabs
ActionPrint=Print
ActionStatusBar=Status bar
ActionSQLAlignments=Alignments
ActionSQLCapitalization=Capitalization
ActionSQLFormatter=SQL Formatter
ActionSQLIndentation=Indentation
ActionSQLInsert=Insert
ActionSQLSelect=Select
ActionSQLUpdate=Update
ActionSQLWhitespace=Whitespace
ActionToolbar=Toolbar
ButtonCancel=Cancel
ButtonOK=&OK
Caption=Options

[UnicodeCharacterMapForm]
Caption=Unicode Character Map

[DirectoryFrame]
ActionDirectoryClose:h=Close the active directory
ActionDirectoryClose=&Close directory
ActionDirectoryClose:s=Shift+Ctrl+D
ActionDirectoryDelete:h=Delete a file or directory
ActionDirectoryDelete=&Delete
ActionDirectoryEdit:h=Edit the active directory
ActionDirectoryEdit=&Edit directory
ActionDirectoryEdit:s=Shift+Ctrl+E
ActionDirectoryOpen:h=Open a new directory
ActionDirectoryOpen=&Open directory
ActionDirectoryOpen:s=Ctrl+D
ActionDirectoryRefresh:h=Refresh files
ActionDirectoryRefresh=&Refresh
ActionDirectoryRename:h=Rename a file or directory
ActionDirectoryRename=Re&name
ActionDirectoryProperties:h=See the file/directory properties
ActionDirectoryProperties=&Properties...
ActionDirectoryFiles=&Files...
ActionDirectoryFiles:h=Search files from the selected directory and its subdirectories
ActionDirectoryFiles:s=Ctrl+F12
ActionDirectoryFindInFiles=&Find in files...
ActionDirectoryFindInFiles:h=Search for a string in multiple files
ActionDirectoryContextMenu=C&ontext menu
ActionDirectoryContextMenu:h=Context menu

[DocumentFrame]
ActionXMLTreeRefresh:h=Refresh XML tree
ActionXMLTreeRefresh=&Refresh

[SearchFrame]
ComboBoxSearchText:h=Search text
ActionFindNext:h=Find next
ActionFindPrevious:h=Find previous
ActionOptions:h=Options
ActionClose:h=Close

[OptionsDirectoryFrame]
StickyLabelShowTreeLines=Show tree lines
StickyLabelShowHiddenFiles=Show hidden files
StickyLabelShowSystemFiles=Show system files
StickyLabelShowArchiveFiles=Show archive files
StickyLabelShowOverlayIcons=Show overlay icons
EditIndent=Indent

[OptionsDirectoryTabsFrame]
StickyLabelCloseTabByDblClick=Close tab by double-click
StickyLabelCloseTabByMiddleClick=Close tab by middle-click
StickyLabelDoubleBuffered=Double buffered
StickyLabelMultiline=Multiline
StickyLabelSaveTabs=Save tabs
StickyLabelShowCloseButton=Show close button
StickyLabelShowOpenDirectoryButton=Show open directory button
StickyLabelShowImage=Show image
StickyLabelRightClickSelect=Right click select

[OptionsEditorDefaultsFrame]
ComboBoxDefaultColor=Color
ComboBoxDefaultEncoding=Encoding
ComboBoxDefaultHighlighter=Highlighter
ComboBoxDefaultSQLHighlighter=SQL highlighter

[OptionsEditorTabsFrame]
StickyLabelCloseTabByDblClick=Close tab by double-click
StickyLabelCloseTabByMiddleClick=Close tab by middle-click
StickyLabelDoubleBuffered=Double buffered
StickyLabelMultiline=Multiline
StickyLabelRightClickSelect=Right click select
StickyLabelSaveTabs=Save Tabs
StickyLabelShowCloseButton=Show close button
StickyLabelShowImage=Show image

[OptionsFileTypesFrame]
EditExtensions=Extensions
VirtualDrawTree:0=File type

[OptionsOutputTabsFrame]
StickyLabelMultiline=Multiline
StickyLabelShowCloseButton=Show close button
StickyLabelShowImage=Show image
StickyLabelCloseTabByDblClick=Close tab by double-click
StickyLabelCloseTabByMiddleClick=Close tab by middle-click
StickyLabelDoubleBuffered=Double buffered
StickyLabelSaveTabs=Save tabs
StickyLabelRightClickSelect=Right click select

[OutputFrame]
ActionCloseAllOtherPages:h=Close all other
ActionCloseAllOtherPages=Close A&ll Other Pages
ActionCopyAllToClipboard:h=Copy all to clipboard
ActionCopyAllToClipboard=C&opy all to clipboard
ActionCopySelectedToClipboard:h=Copy selected to clipboard
ActionCopySelectedToClipboard=Copy selected to clipboard
ActionOpenAll:h=Open all files
ActionOpenAll=&Open all
ActionOpenSelected:h=Open selected files
ActionOpenSelected=&Open selected
ActionOutputClose:h=Close current page
ActionOutputClose=&Close
ActionOutputCloseAll:h=Close all pages
ActionOutputCloseAll=Close &all
ActionSelectAll:h=Select all files
ActionSelectAll=Select all
ActionUnSelectAll:h=Unselect all files
ActionUnSelectAll=Unselect all

[SQLFormatterConstant]
Stacked=Stacked
Wrapped=Wrapped
AfterComma=After comma
BeforeComma=Before comma
BeforeCommaWithSpace=Before comma with space
NoLineBreak=No line break
BeforeAndOr=Before AND/OR
AfterAndOr=After AND/OR
Left=Left
Right=Right
None=None
Uppercase=Uppercase
Lowercase=Lowercase
SentenceCase=Sentence case
NoChange=No change

[ConvertConstant]
Distance=Distance
Micromicrons=Micromicrons
Angstroms=Angstroms
Millimicrons=Millimicrons
Microns=Microns
Millimeters=Millimeters
Centimeters=Centimeters
Decimeters=Decimeters
Meters=Meters
Decameters=Decameters
Hectometers=Hectometers
Kilometers=Kilometers
Megameters=Megameters
Gigameters=Gigameters
Inches=Inches
Feet=Feet
Yards=Yards
Miles=Miles
NauticalMiles=Nautical miles
AstronomicalUnits=Astronomical units
LightYears=Light years
Parsecs=Parsecs
Cubits=Cubits
Fathoms=Fathoms
Furlongs=Furlongs
Hands=Hands
Paces=Paces
Rods=Rods
Chains=Chains
Links=Links
Picas=Picas
Points=Points
Area=Area
SquareMillimeters=Square millimeters
SquareCentimeters=Square centimeters
SquareDecimeters=Square decimeters
SquareMeters=Square Meters
SquareDecameters=Square decameters
SquareHectometers=Square hectometers
SquareKilometers=Square kilometers
SquareInches=Square inches
SquareFeet=Square feet
SquareYards=Square yards
SquareMiles=Square miles
Acres=Acres
Centares=Centares
Ares=Ares
Hectares=Hectares
SquareRods=Square rods
Volume=Volume
CubicMillimeters=Cubic millimeters
CubicCentimeters=Cubic centimeters
CubicDecimeters=Cubic decimeters
CubicMeters=Cubic meters
CubicDecameters=Cubic decameters
CubicHectometers=Cubic hectometers
CubicKilometers=Cubic kilometers
CubicInches=Cubic inches
CubicFeet=Cubic feet
CubicYards=Cubic yards
CubicMiles=Cubic miles
MilliLiters=Milli liters
CentiLiters=Centi liters
DeciLiters=Deci liters
Liters=Liters
DecaLiters=Deca liters
HectoLiters=Hecto liters
KiloLiters=Kilo liters
AcreFeet=Acre feet
AcreInches=Acre inches
Cords=Cords
CordFeet=Cord feet
Decisteres=Decisteres
Steres=Steres
Decasteres=Decasteres
FluidGallons=Fluid gallons
FluidPints=Fluid pints
FluidQuarts=Fluid quarts
FluidCups=Fluid cups
FluidGills=Fluid gills
FluidOunces=Fluid ounces
FluidTablespoons=Fluid tablespoons
FluidTeaspoons=Fluid teaspoons
DryGallons=Dry gallons
DryQuarts=Dry quarts
DryPints=Dry pints
DryPecks=Dry pecks
DryBuckets=Dry buckets
DryBushels=Dry bushels
UKGallons=UK gallons
UKPottle=UK pottles
UKQuarts=UK quarts
UKPints=UK pints
UKGill=UK gills
UKOunces=UK ounces
UKPecks=UK pecks
UKBuckets=UK buckets
UKBushels=UK bushels
Mass=Mass
Nanograms=Nanograms
Micrograms=Micrograms
Milligrams=Milligrams
Centigrams=Centigrams
Decigrams=Decigrams
Grams=Grams
Decagrams=Decagrams
Hectograms=Hectograms
Kilograms=Kilograms
MetricTons=Metric tons
Drams=Drams
Grains=Grains
LongTons=Long tons
Tons=Tons
Ounces=Ounces
Pounds=Pounds
Stones=Stones
NumeralSystem=Numeral system
Binary=Binary
Decimal=Decimal
Hexadecimal=Hexadecimal
Temperature=Temperature
Celsius=Celsius
Kelvin=Kelvin
Fahrenheit=Fahrenheit
Time=Time
Reaumur=Reaumur
Rankine=Rankine
MilliSeconds=Milli seconds
Seconds=Seconds
Minutes=Minutes
Hours=Hours
Days=Days
Weeks=Weeks
Fortnights=Fortnights
Months=Months
Years=Years
Decades=Decades
Centuries=Centuries
Millennia=Millennia
DateTime=Date time
JulianDate=Julian date
ModifiedJulianDate=Modified Julian date
